Tekla Open API Reference for Tekla Structures 2025
BinaryFilterExpressionCollection.GetFirst Method
 Gets the first item of the collection.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BinaryFilterExpressionItem GetFirst()
Public Function GetFirst As BinaryFilterExpressionItem
Return Value
Type: BinaryFilterExpressionItem
The first item of the collection.
See Also
Reference
BinaryFilterExpressionCollection Class
Tekla.Structures.Filtering Namespace